# Дан текст. Найти наибольшее количество идущих подряд одинаковых символов.

# -*- coding: utf-8 -*-

if __name__ == '__main__':

    s = input("Введите текст: ")
    c = [0, 0]
    l = [s[0], s[0]]
    for i in s:
        if i == l[1]:
            c[1] += 1
            if c[1] > c[0]:
                c[0] = c[1]
                l[0] = l[1]
        else:
            c[1] = 1
            l[1] = i
    print(c[0], l[0])
